app/modules/importer.rb

  def self.map_domains(obj,hash)
    hash.values.flatten.each do |v|
      begin
        obj.domain_names.create(name:v)
---
INSERT INTO "domain_names" ("name", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kage.com"], ["organization_id", 1], ["created_at", "2019-08-18 03:40:09.967157"], ["updated_at", "2019-08-18 03:40:09.967157"]]

  def self.map_tags(obj,hash)
    hash.values.flatten.each do |v|
      begin
        obj.tags.create(name:v, taggable_id: obj.id, taggable_type: obj.class.to_s)
---
INSERT INTO "tags" ("name", "taggable_type", "taggable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ohio"], ["taggable_type", "Ticket"], ["taggable_id", 436], ["created_at", "2019-08-18 03:34:09.195119"], ["updated_at", "2019-08-18 03:34:09.195119"]]