app/controllers/organizations_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE ('id = ?',[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]) LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "organizations" WHERE (name = 'Francisca Rasmussen	')
SELECT  "organizations".* FROM "organizations" WHERE (id = (1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26)) LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "organizations" WHERE (name = 'enthaze')
---
  def index
    begin
      @organizations = Organization.get_result(params[:select_attribute], params[:q].try(:strip)).paginate(page: params[:page])
    rescue Exception => e
      flash.now[:notice] = e
    end
    @attributes = Organization.get_attributes
    flash.now[:notice] ||= "Search results count: #{@organizations.size}" if params[:select_attribute]