app/controllers/tickets_controller.rb

  def index
    begin
      @tickets = Ticket.get_result(params[:select_attribute], params[:q].try(:strip)).paginate(page: params[:page])
---
SELECT  "tickets".* FROM "tickets" WHERE (url = 'http://initech.zendesk.com/api/v2/tickets/1a227508-9f39-427c-8f57-1b72f3fab87c.json') LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tickets" WHERE (url = 'http://initech.zendesk.com/api/v2/tickets/1a227508-9f39-427c-8f57-1b72f3fab87c.json')