app/controllers/users_controller.rb

  def index
    begin
      @users = User.get_result(params[:select_attribute], params[:q].try(:strip)).paginate(page: params[:page])
    rescue Exception => e
      flash.now[:notice] = e
    end
    @attributes = User.get_attributes
    flash.now[:notice] = "Search results count: #{@users.size}" if params[:select_attribute]
---
SELECT  "users".* FROM "users" WHERE (url = 'http://initech.zendesk.com/api/v2/users/1.json') LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (url = 'http://initech.zendesk.com/api/v2/users/1.json')
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users" WHERE (name = 'Francisca Rasmussen')